{
	"@metadata": {
		"authors": [
			"Alex4401",
			"Amire80"
		]
	},
	"datamap-desc": "{{desc\n| name = DataMaps\n| url = https://mediawiki.org/wiki/Extension:DataMaps\n}}",
	"content-model-datamap": "The name for Interactive Data Map content model, used when describing what type of content a page contains.",
	"datamap-doc-page-does-not-exist": "Message displayed if the documentation page does not exist. Parameters:\n* $1 - the prefixed title of the doc page",
	"datamap-doc-page-header": "Message displayed at the top of the documentation page. Parameters:\n* $1 - the prefixed title of the module",
	"datamap-category-pages-including-maps": "{{tracking category name}}\nName of the tracking category for pages including maps.",
	"datamap-category-pages-including-broken-maps": "{{tracking category name}}\nName of the tracking category for pages including maps failing validation.",
	"datamap-category-maps-failing-validation": "{{tracking category name}}\nName of the tracking category for maps failing validation.",
	"datamap-mapsrcinfo-internal-page": "{{Doc-screenshot|DataMaps Source code page notice no errors.png}}\nMessage shown in a box above the map, only on source code pages (that is, not in articles). It informs the editor that readers should view maps embedded in articles, rather than using the source code page.\n\nAlternative wording if English one is too awkward:\n* \"You're currently on the source code page of this map. [...]\"\n* or \"This page is the source page of a map. [...]\"",
	"datamap-mapsrcinfo-status-ok": "{{Doc-screenshot|DataMaps Source code page notice no errors.png}}\nMessage shown in a box above the map, only on source code pages (that is, not in articles). It indicates no problems with the map's source code (it passes data validation).",
	"datamap-mapsrcinfo-status-meh": "Message shown in a box above the map, only on source code pages (that is, not in articles). It indicates minor problems (warnings from data validation) with the map's source code - such as using a deprecated schema revision, or fields that won't be supported in future.\n\nThis message is immediately followed by message <code>datamap-mapsrcinfo-heading-warnings</code> on the next line, with a list of the errors.",
	"datamap-mapsrcinfo-status-errors": "{{Doc-screenshot|DataMaps Source code page notice with errors.png}}\nMessage shown in a box instead of the map, only on source code pages (that is, not in articles). It indicates fatal errors with the map's source code (it does not pass data validation), and requires the errors to be fixed before the map can be displayed again.\n\nThis message is immediately followed by message <code>datamap-mapsrcinfo-heading-errors</code> on the next line, with a list of the errors. Optionally, <code>datamap-mapsrcinfo-heading-warnings</code> may also be shown below if any warnings had been raised during validation.",
	"datamap-mapsrcinfo-heading-errors": "{{Doc-screenshot|DataMaps Source code page notice with errors.png}}\nMessage used to display the error list on validation errors instead of the map, only on source code pages. It is always accompanied by <code>datamap-mapsrcinfo-status-errors</code>.\n\nParameters:\n* $1 - the error bulletpoint list.",
	"datamap-mapsrcinfo-heading-warnings": "Message used to display the warning list on validation issues above the map, only on source code pages. It is always accompanied by <code>datamap-mapsrcinfo-status-meh</code>, and sometimes by <code>datamap-mapsrcinfo-status-errors</code>.\n\nParameters:\n* $1 - the warning bulletpoint list.",
	"datamap-mapsrcinfo-docslink": "Message shown after validation errors and warnings. It informs the user of the extension's documentation pages and issue tracker.\n\nParameters:\n* $1 - non-localisable documentation link.\n* $2 - non-localisable issue tracker link.",
	"datamap-error-validate-invalid-json": "Error message shown on general JSON syntax errors.",
	"datamap-error-bad-schema-origin": "{{doc-important|Do not translate <code>$schema</code>}}\nError shown if the map's source code has no <code>$schema</code> field or it points at an unsupported JSON schema file.\n\nParameters:\n* $1 - default schema link (within the wiki's domain), for example <code>https://temtem.wiki.gg/extensions/DataMaps/schemas/v0.16.json</code>.",
	"datamap-error-deprecated-schema-version": "Warning shown if the map follows a deprecated schema/format revision, support for which will be removed in a future extension update.\n\nAs all validation warnings, it is only visible when previewing the map in an editor, attempting to save with validation errors, or when viewing the map's source page directly.\n\nParameters:\n* $1 - future extension version, which will drop support for the schema revision.\n* $2 - non-localised list of supported schema revisions, separated by ', '.",
	"datamap-error-validate-unexpected-fields": "Error message shown when the map's source code contains an unknown field that's not defined in the schema.\n\nParameters:\n* $1 - non-localised structure name, such as 'CoordinateSystem', 'MapSettingsSpec', 'MarkerSpec', etc.\n* $2 - non-localised list of fields that caused this error, separated with ', '.",
	"datamap-error-validate-field-no-value": "Error message shown when a field, whose value is the name of a file expected to exist, is empty.\n\nIn future, this message will also apply to marker group names, marker category names, marker titles, marker descriptions as well.\n\nParameters:\n* $1 - non-localised structure name, such as 'CoordinateSystem', 'MapSettingsSpec', 'MarkerSpec', etc.\n* $2 - non-localised name of the field that caused this error.",
	"datamap-error-validate-field-required": "Error message shown when a field is expected (required per schema) in the map's source code, but is missing.\n\nParameters:\n* $1 - non-localised structure name, such as 'CoordinateSystem', 'MapSettingsSpec', 'MarkerSpec', etc.\n* $2 - non-localised name of the missing field.",
	"datamap-error-validate-field-required-alt": "Unused message.",
	"datamap-error-validate-field-required-either": "Error message shown when a field is expected (required per schema) in the map's source code, but is missing. The field has two possible names.\n\nParameters:\n* $1 - non-localised structure name, such as 'CoordinateSystem', 'MapSettingsSpec', 'MarkerSpec', etc.\n* $2 - first non-localised name of the missing field, for example <code>lat</code> (''latitude'').\n* $3 - second non-localised name of the missing field, for example <code>y</code>.",
	"datamap-error-validate-no-file": "Error shown when the file (referenced in the map's source code) does not exist.\n\nParameters:\n* $1 - the file's name.",
	"datamap-error-validate-limit": "Error message shown when map validation is stopped because too many issues have been found.\n\nParameters:\n* $1 - non-localised structure name, such as 'CoordinateSystem', 'MapSettingsSpec', 'MarkerSpec', etc.",
	"datamap-error-validatespec-map-no-group-name": "Error shown when the user attempts to give a marker group an empty ID.\n\n''NOTE: English string incorrectly refers to the ID as \"name\". Please pretend it says \"no (or an empty) ID\" instead. This is tracked as issue #222 on GitHub.''",
	"datamap-error-validatespec-map-illegal-group-name": "Error shown when the user attempts to use a white-space character (e.g. a space) in a marker group's ID.\n\n''NOTE: English string incorrectly refers to the IDs as \"names\". Please pretend it says \"IDs of marker groups\" instead. This is tracked as issue #222 on GitHub.''\n\nParameters:\n* $1 - the invalid layer ID.",
	"datamap-error-validatespec-map-illegal-layer-name": "Error shown when the user attempts to use a white-space character (e.g. a space) in a marker category's ID.\n\n''NOTE: English string incorrectly refers to the IDs as \"names\", and uses outdated wording for marker categories. Please pretend it says \"IDs of marker categories\" instead. This is tracked as issue #222 on GitHub.''\n\nParameters:\n* $1 - the invalid layer ID.",
	"datamap-error-validatespec-map-duplicate-assoc-layers": "Error shown when a marker layer (a group or a category) is listed more than once in a marker set's association string. (In other words, the group/category name is duplicated when defining a marker set)",
	"datamap-error-validatespec-map-missing-group": "Error shown when the map contains markers assigned to a group that hasn't been defined.\n\nParameters:\n* $1 - the group's supposed ID (provided by an editor).",
	"datamap-error-validatespec-map-bad-mixin": "{{doc-important|The content model name should match <code>content-model-datamap</code>}}\nError message when a reusable source fragment page does not exist, has an incorrect content model or fails validation.\n\nParameters:\n* $1 - page name of the referenced fragment.",
	"datamap-error-validatespec-map-missing-fragment-ns": "Error message shown when a reusable source fragment is referenced without a namespace in the map's source code.",
	"datamap-error-validatespec-map-name-conflict-group-layer": "Error shown when the user creates a marker category with an ID that is already assigned to some marker group.\n\n''NOTE: English string incorrectly refers to marker categories as \"layers\". Please pretend it says \"Found marker category\" instead. This is tracked as issue #222 on GitHub.''\n\nParameters:\n* $1 - the overlapping layer ID.",
	"datamap-error-validatespec-map-uid-conflict": "Error shown when a marker in the map has a non-unique custom identifier.\n\nParameters:\n* $1 - bad custom identifier that caused the error.",
	"datamap-error-validatespec-map-mixin-with-mixins": "Error message shown when a reusable source fragment contains a <code>include</code> field to include other fragments.",
	"datamap-error-render-unsupported-displaymode": "Error shown when the programmer messed up in the extension's code. 'Display mode' refers to a marker's visual style (circular, icon, pin), but the server-side code does not know how to handle it.\n\nParameters:\n* $1 - internal numeric ID of a marker visual style.",
	"datamap-error-pf-page-does-not-exist": "Error shown instead of a map when the map's source page does not exist.\n\nParameters:\n* $1 - page name of the map.",
	"datamap-error-pf-page-invalid-content-model": "{{doc-important|The content model name should match <code>content-model-datamap</code>}}\nError shown instead of a map when the map's source page is not of the <code>Interactive Data Map</code> content model.\n\nParameters:\n* $1 - page name of the map.",
	"datamap-error-pf-max-width-invalid": "Error shown instead of a map when the <code>max-width</code> parameter (provided by an editor to the <code>DataMap</code>/<code>Map</code> function) is equal to or lower than zero.",
	"datamap-error-map-validation-fail": "Error message shown instead of the map if the source code no longer passes data validation without errors (likely due to the extension getting updated).",
	"datamap-legend-label": "Button label for opening the legend panel (including filtering buttons, collectibles list) of the map.",
	"datamap-javascript-required": "Message shown instead of the map if the reader has JavaScript support disabled in their browser.",
	"datamap-loading-js": "Message temporarily shown instead of a map while the extension's scripts are being loaded.",
	"datamap-loading-data": "Message temporarily shown instead of a map while the map's data is being loaded.",
	"datamap-error-dataload": "Error shown over a map if the map's data failed to load. The reason for the failure is unknown (but likely occurred due to a server-side or network error).",
	"datamap-lazy-click-to-load": "Label of the button used to load a data map a request, if the map is set not to load on page view.",
	"datamap-legend-tab-locations": "Label of the legend (Contents) tab containing toggles for marker visibility.",
	"datamap-toggle-show-all": "Label of the button used to set all marker groups to be shown, in a single click. It is located above marker group visibility toggles.\n{{Identical|Show all}}",
	"datamap-toggle-hide-all": "Label of the button used to set all marker groups to not be shown, in a single click. It is located above marker group visibility toggles.",
	"datamap-layer-control": "Label of the dropdown button, which lists visibility toggles for marker categories. It is located above marker group visibility toggles, only if there are any markers that would be affected by toggles within.\n\nAt the moment, this dropdown only lists the ''Caves'' and ''Surface'' toggles.",
	"datamap-legend-tab-checklist": "Label of the legend (Contents) tab containing all lists of available collectibles on the map.",
	"datamap-checklist-prelude": "Message shown at the top of the 'Checklists' tab. It refers to collectible markers, which the user can dismiss to hide.",
	"datamap-interact-touch": "Message shown over the map on mobile devices when the viewer attempts to reposition the viewport with a single finger. This requirement exists to avoid interfering with page scrolling.",
	"datamap-interact-scroll": "Message shown over the map on desktop devices when the viewer attempts to reposition the viewport with a simple mouse drag. This requirement exists to avoid interfering with page scrolling.\n\n<code>CTRL</code> and <code>Scroll</code> refer to the <kbd>Control</kbd> key on keyboard and mouse scrolling respectively.",
	"datamap-interact-scroll-mac": "Message shown over the map on desktop devices when the viewer attempts to reposition the viewport with a simple mouse drag. This requirement exists to avoid interfering with page scrolling.\n\n<code>⌘</code> and <code>Scroll</code> refer to the <kbd>⌘</kbd> key on Mac keyboards and mouse scrolling respectively.",
	"datamap-layer-surface": "Label of the toggle checkbox that controls visibility of markers located on surface (not in caves). It is located in the \"Toggle\" dropdown above marker group visibility toggles, next to the \"Show all\" and \"Hide all\" buttons.\n\nThis is a part of the old category model (which was specific to the ARK Wiki) and will be removed in future with a dynamic/runtime system.",
	"datamap-layer-cave": "Label of the toggle checkbox that controls visibility of markers located inside caves. It is located in the \"Toggle\" dropdown above marker group visibility toggles, next to the \"Show all\" and \"Hide all\" buttons.\n\nThis is a part of the old category model (which was specific to the ARK Wiki) and will be removed in future with a dynamic/runtime system.",
	"datamap-popup-related-article": "Link label for the 'Read more' button (that leads to an article) at the bottom of a marker's detail popup.\n{{Identical|Read more}}",
	"datamap-popup-dismissed": "Label for the 'Collected' button at the bottom of a marker's detail popup. It denotes the marker has already been dismissed/hidden, and that state can be reverted by clicking this button.",
	"datamap-popup-mark-as-dismissed": "Label for the 'Mark as collected' button (that hides the marker) at the bottom of a marker's detail popup. It denotes the marker can be dismissed/hidden.",
	"datamap-popup-marker-link-get": "Text letting users know that they can copy a sharable link to a marker on the map. Displayed at the bottom of a marker's details popup.",
	"datamap-popup-marker-link-copied": "Message shown when a marker link is successfully copied to the viewer's clipboard.",
	"datamap-coordinate-control-text": "On maps configured to use a coordinate scheme of 'Latitude then Longitude', message shown in the bottom-left corner of the map containing current mouse cursor coordinates, if the mouse cursor is currently over the map.\n\nParameters:\n* $1 - latitude.\n* $2 - longitude.\n\nMaps using other schemes will use one of following messages instead:\n* datamap-coordinate-control-text-xy\n* datamap-coordinate-control-text-yx",
	"datamap-coordinate-control-text-xy": "{{optional}}\nOn maps configured to use a coordinate scheme of 'X then Y', message shown in the bottom-left corner of the map containing current mouse cursor coordinates, if the mouse cursor is currently over the map.\n\nParameters:\n* $1 - Y coordinate.\n* $2 - X coordinate.\n\nMaps using other schemes will use one of following messages instead:\n* datamap-coordinate-control-text\n* datamap-coordinate-control-text-yx",
	"datamap-coordinate-control-text-yx": "{{optional}}\nOn maps configured to use a coordinate scheme of 'Y then X', message shown in the bottom-left corner of the map containing current mouse cursor coordinates, if the mouse cursor is currently over the map.\n\nParameters:\n* $1 - Y coordinate.\n* $2 - X coordinate.\n\nMaps using other schemes will use one of following messages instead:\n* datamap-coordinate-control-text\n* datamap-coordinate-control-text-xy",
	"datamap-control-zoom-in": "Title for map zoom in button.\n{{Identical|Zoom in}}",
	"datamap-control-zoom-out": "Title for map zoom out button.\n{{Identical|Zoom out}}",
	"datamap-control-toggle-legend": "Tooltip of the 'Contents' (legend) collapsible bar.",
	"datamap-control-reset-view": "Title for map button restoring default viewport location and zoom.",
	"datamap-control-centre-view": "Title for map button placing the viewport at the centre of the map.",
	"datamap-control-edit": "Label of the button that opens the map's source page in an editor. Shown only to logged-in users.",
	"datamap-control-search": "Text message shown in the map's marker search text field when empty, prompting the viewer to input a query.",
	"datamap-control-search-toggle-sharing": "Label for a toggle situated in the marker search text input. The toggle controls whether results from other map tabs within a tabber will be shown within this map's search results.\n\nAlternatively \"All tabs\". Please keep this message short if possible.",
	"datamap-control-search-no-results": "Text message that no markers were found. Shown in the map's built-in search panel.",
	"datamap-control-fullscreen": "Tooltip for the button that switches the map into (and out of) full screen mode."
}
